app/controllers/foods_controller.rb

  def index
    #foods = Food.all

    @foods = Food.all.order("created_at DESC").paginate(:page => params[:page], :per_page => 10)
---
SELECT  "foods".* FROM "foods"  ORDER BY created_at DESC LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "foods"

  def show
    @food = Food.find_by(id: params[:id])
---
SELECT  "foods".* FROM "foods" WHERE "foods"."id" = ? LIMIT 1  [["id", 28]]

  def edit
    @food = Food.find_by(id: params[:id])
---
SELECT  "foods".* FROM "foods" WHERE "foods"."id" = ? LIMIT 1  [["id", 28]]